Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# AdvancedSetting.warnAboutSecureKeyboardInputWithOpenCommand
source: Warn if the `open` command appears to fail when secure keyboard input is enabled?
de: Warnen, wenn der Befehl `open` bei aktivierter sicherer Tastatureingabe zu scheitern scheint?
ja: セキュアキーボード入力が有効なときに`open`コマンドが失敗したように見える場合、警告しますか？
pt_br: Avisar se o comando `open` parecer falhar quando a entrada de teclado segura estiver ativada?
ru: Предупреждать, если команда `open` не срабатывает при включённом безопасном вводе с клавиатуры?
zh_hans: 在启用安全键盘输入时，如果 `open` 命令似乎失败，是否发出警告？

# AdvancedSetting.webInstantReplayFrameRate
source: Instant replay frame rate for web browser sessions
de: Bildwiederholrate der Sofortwiedergabe für Webbrowser-Sitzungen
ja: Webブラウザセッションのインスタントリプレイのフレームレート
pt_br: Taxa de quadros do Instant Replay para sessões de navegador web
ru: Частота кадров мгновенного повтора для сеансов веб-браузера
zh_hans: 网络浏览器会话的即时回放帧率。

# AdvancedSetting.webKitAdblockEnabled
source: Enable ad blocking in the web browser? When enabled, downloads and applies ad blocking rules from the configured URL.
de: Werbeblockierung im Webbrowser aktivieren? Wenn aktiviert, werden Werbeblockierregeln von der konfigurierten URL heruntergeladen und angewendet.
ja: Webブラウザで広告ブロックを有効にしますか？ 有効にすると、設定されたURLから広告ブロックルールをダウンロードして適用します。
pt_br: Ativar bloqueio de anúncios no navegador web? Quando ativado, baixa e aplica regras de bloqueio de anúncios da URL configurada.
ru: Включить блокировку рекламы в веб-браузере? Если включено, загружает и применяет правила блокировки рекламы с настроенного URL.
zh_hans: 在网页浏览器中启用广告拦截？ 当启用时，会下载并应用来自配置 URL 的广告拦截规则。

# AdvancedSetting.webUserAgent
source: User agent for web views. Leave empty to use system default.
de: User-Agent für Web-Ansichten. Leer lassen, um die Systemvorgabe zu verwenden.
ja: Webビューのユーザーエージェント。システムのデフォルトを使用するには空のままにしてください。
pt_br: User agent para visualizações web. Deixe vazio para usar o padrão do sistema.
ru: User-Agent для веб-представлений. Оставьте пустым, чтобы использовать значение системы по умолчанию.
zh_hans: 网页视图的用户代理。留空则使用系统默认。

# AdvancedSetting.windowBorderColor
source: Border color for focused windows. Should be a web-style color, #rrggbb, or #rrggbbaa to also set opacity. You can also use p3#rrggbb or p3#rrggbbaa for p3 color space. Without an alpha component the border is drawn at 75% opacity. Requires “Show border around windows” with no title bar. Leave empty for the default color.
de: Rahmenfarbe für fokussierte Fenster. Sollte eine Farbe im Web-Format sein, #rrggbb, oder #rrggbbaa, um auch die Deckkraft festzulegen. Sie können auch p3#rrggbb oder p3#rrggbbaa für den P3-Farbraum verwenden. Ohne Alpha-Komponente wird der Rahmen mit 75 % Deckkraft gezeichnet. Erfordert „Rahmen um Fenster anzeigen“ ohne Titelleiste. Leer lassen für die Standardfarbe.
ja: フォーカスされたウィンドウの枠線の色。 Webスタイルの色、または不透明度も設定できる#rrggbbや#rrggbbaaを指定してください。p3カラースペースにはp3#rrggbbやp3#rrggbbaaも使用できます。アルファ成分がない場合、枠線は75%の不透明度で描画されます。タイトルバーなしの「ウィンドウに枠線を表示」が必要です。デフォルトの色を使用するには空のままにしてください。
pt_br: Cor da borda para janelas em foco. Deve ser uma cor no estilo web, #rrggbb, ou #rrggbbaa para também definir a opacidade. Você também pode usar p3#rrggbb ou p3#rrggbbaa para o espaço de cores p3. Sem um componente alfa, a borda é desenhada a 75% de opacidade. Requer “Mostrar borda ao redor das janelas” sem barra de título. Deixe vazio para a cor padrão.
ru: Цвет рамки для окон в фокусе. Должен быть цветом в веб-стиле, #rrggbb, или #rrggbbaa, чтобы также задать прозрачность. Также можно использовать p3#rrggbb или p3#rrggbbaa для цветового пространства P3. Без альфа-компонента рамка отображается с непрозрачностью 75%. Требует включённого параметра «Показывать рамку вокруг окон» без заголовка окна. Оставьте пустым для цвета по умолчанию.
zh_hans: 聚焦窗口的边框颜色。 应为网页风格的颜色，#rrggbb 或 #rrggbbaa 也可用于设置透明度。对于 p3 颜色空间，还可以使用 p3#rrggbb 或 p3#rrggbbaa。若没有 alpha 组件，边框的透明度为 75%。需要开启“在无标题栏的情况下显示窗口边框”选项。若为空，则使用默认颜色。

# AdvancedSetting.windowBorderColorUnfocused
source: Border color for unfocused windows. Should be a web-style color, #rrggbb, or #rrggbbaa to also set opacity. You can also use p3#rrggbb or p3#rrggbbaa for p3 color space. Without an alpha component the border is drawn at 75% opacity. Leave empty to match the focused color.
de: Rahmenfarbe für nicht fokussierte Fenster. Sollte eine Farbe im Web-Format sein, #rrggbb, oder #rrggbbaa, um auch die Deckkraft festzulegen. Sie können auch p3#rrggbb oder p3#rrggbbaa für den P3-Farbraum verwenden. Ohne Alpha-Komponente wird der Rahmen mit 75 % Deckkraft gezeichnet. Leer lassen, um die Farbe des fokussierten Fensters zu übernehmen.
ja: フォーカスされていないウィンドウの枠線の色。 Webスタイルの色、または不透明度も設定できる#rrggbbや#rrggbbaaを指定してください。p3カラースペースにはp3#rrggbbやp3#rrggbbaaも使用できます。アルファ成分がない場合、枠線は75%の不透明度で描画されます。フォーカス時の色と合わせるには空のままにしてください。
pt_br: Cor da borda para janelas fora de foco. Deve ser uma cor no estilo web, #rrggbb, ou #rrggbbaa para também definir a opacidade. Você também pode usar p3#rrggbb ou p3#rrggbbaa para o espaço de cores p3. Sem um componente alfa, a borda é desenhada a 75% de opacidade. Deixe vazio para corresponder à cor de foco.
ru: Цвет рамки для окон вне фокуса. Должен быть цветом в веб-стиле, #rrggbb, или #rrggbbaa, чтобы также задать прозрачность. Также можно использовать p3#rrggbb или p3#rrggbbaa для цветового пространства P3. Без альфа-компонента рамка отображается с непрозрачностью 75%. Оставьте пустым, чтобы использовать цвет окон в фокусе.
zh_hans: 未聚焦窗口的边框颜色。 应为网页风格的颜色，#rrggbb 或 #rrggbbaa 也可用于设置透明度。对于 p3 颜色空间，还可以使用 p3#rrggbb 或 p3#rrggbbaa。若没有 alpha 组件，边框的透明度为 75%。若为空，则与聚焦窗口颜色一致。

# AdvancedSetting.wordSelectionRegexRadius
source: Maximum number of characters before and after the click location to search when applying word selection regex patterns.
de: Maximale Anzahl von Zeichen vor und nach der Klickposition, die beim Anwenden von Wortauswahl-Regex-Mustern durchsucht werden.
ja: 単語選択の正規表現パターンを適用する際に、クリック位置の前後で検索する文字数の最大値。
pt_br: Número máximo de caracteres antes e depois do local do clique a buscar ao aplicar padrões de regex de seleção de palavras.
ru: Максимальное число символов до и после места клика, в пределах которого выполняется поиск при применении шаблонов регулярных выражений для выделения слова.
zh_hans: 应用词选择正则表达式模式时，点击位置前后最大字符数限制。

# AdvancedSetting.workAroundMultiDisplayOSBug
source: Work around a macOS bug where the OS moves windows to the first display for no good reason.
de: Umgehung eines macOS-Fehlers, bei dem das Betriebssystem Fenster ohne triftigen Grund auf den ersten Bildschirm verschiebt.
ja: OSが理由もなくウィンドウを最初のディスプレイに移動させるmacOSのバグを回避します。
pt_br: Contornar um erro do macOS em que o sistema move janelas para a primeira tela sem um bom motivo.
ru: Обходить ошибку macOS, из-за которой система без видимой причины перемещает окна на первый экран.
zh_hans: 解决 macOS 的一个缺陷：系统无理由将窗口移动到第一个显示器上。

# AdvancedSetting.workAroundNumericKeypadBug
source: Treat the equals sign on the numeric keypad as a key on the numeric keypad. For mysterious reasons, macOS does not treat this key as belonging to the numeric keypad. Enable this setting to work around the bug.
de: Das Gleichheitszeichen auf dem Ziffernblock als Taste des Ziffernblocks behandeln. Aus mysteriösen Gründen behandelt macOS diese Taste nicht als Teil des Ziffernblocks. Aktivieren Sie diese Einstellung, um den Fehler zu umgehen.
ja: テンキーのイコール記号をテンキーのキーとして扱います。 不可解な理由により、macOSはこのキーをテンキーに属するものとして扱いません。このバグを回避するには、この設定を有効にしてください。
pt_br: Tratar o sinal de igual do teclado numérico como uma tecla do teclado numérico. Por razões misteriosas, o macOS não trata esta tecla como pertencente ao teclado numérico. Ative este ajuste para contornar o erro.
ru: Считать знак равенства на цифровой клавиатуре клавишей цифровой клавиатуры. По непонятным причинам macOS не считает эту клавишу принадлежащей цифровой клавиатуре. Включите этот параметр, чтобы обойти ошибку.
zh_hans: 将数字小键盘上的等号视为数字小键盘的按键。 由于神秘原因，macOS 不将此键视为数字小键盘的一部分。开启此设置可解决该缺陷。

# AdvancedSetting.workgroupAutoSendSubmitDelay
source: Delay in seconds before the Return that submits an auto-sent code review. When the code-review workgroup toolbar auto-sends review results to the main session, it pastes the results and then sends a Return to submit them. This is how long it waits, after the pasted results finish, before sending that Return. A paste-debouncing TUI (such as Claude Code) processes a paste and a Return that arrive together as one batch, so the Return can be swallowed and the review never submits; the delay makes the Return land in a later read so it submits. The default matches Claude Code’s 500 ms paste-settling window. Set to 0 to send it immediately.
de: Verzögerung in Sekunden vor der Eingabetaste, die eine automatisch gesendete Code-Review übermittelt. Wenn die Workgroup-Symbolleiste für die Code-Review Überprüfungsergebnisse automatisch an die Hauptsitzung sendet, fügt sie die Ergebnisse ein und sendet anschließend eine Eingabetaste, um sie zu übermitteln. Diese Einstellung gibt an, wie lange nach dem Abschluss des Einfügens gewartet wird, bevor diese Eingabetaste gesendet wird. Eine TUI mit Paste-Entprellung (wie Claude Code) verarbeitet ein Einfügen und eine Eingabetaste, die zusammen in einem Batch eintreffen, sodass die Eingabetaste verschluckt werden kann und die Überprüfung nie übermittelt wird; die Verzögerung sorgt dafür, dass die Eingabetaste in einem späteren Lesevorgang ankommt, sodass sie übermittelt wird. Die Vorgabe entspricht dem 500-ms-Fenster von Claude Code zum Abschließen des Einfügevorgangs. Auf 0 setzen, um sie sofort zu senden.
ja: 自動送信されるコードレビューを送信するReturnキーまでの遅延（秒）。 コードレビューワークグループツールバーがレビュー結果をメインセッションに自動送信する際、結果をペーストしてからReturnキーを送信して送信を確定します。これは、ペーストした結果が完了してからそのReturnキーを送信するまでの待機時間です。ペーストのデバウンス処理を行うTUI（Claude Codeなど）は、同時に届いたペーストとReturnキーを1つのバッチとして処理するため、Returnキーが飲み込まれてレビューが送信されないことがあります。この遅延により、Returnキーは後の読み取りに含まれるようになり、送信されるようになります。デフォルト値は、Claude Codeの500ミリ秒のペースト確定ウィンドウに合わせています。すぐに送信するには0に設定してください。
pt_br: Atraso em segundos antes do Return que envia uma revisão de código enviada automaticamente. Quando a barra de ferramentas do grupo de trabalho de revisão de código envia automaticamente os resultados da revisão para a sessão principal, ela cola os resultados e depois envia um Return para submetê-los. Este é o tempo que ela espera, após os resultados colados terminarem, antes de enviar esse Return. Uma TUI que faz debounce de colagem (como o Claude Code) processa uma colagem e um Return que chegam juntos como um único lote, então o Return pode ser engolido e a revisão nunca é submetida; o atraso faz o Return chegar em uma leitura posterior para que seja submetido. O padrão corresponde à janela de estabilização de colagem de 500 ms do Claude Code. Defina como 0 para enviá-lo imediatamente.
ru: Задержка в секундах перед нажатием Return, которое отправляет автоматически отправленную проверку кода. Когда панель инструментов рабочей группы проверки кода автоматически отправляет результаты проверки в основной сеанс, она вставляет результаты, а затем отправляет Return для их отправки. Это время, которое проходит после завершения вставки результатов, перед отправкой этого Return. TUI с подавлением дребезга вставки (например, Claude Code) обрабатывает вставку и Return, пришедшие вместе, как один пакет, поэтому Return может быть «проглочен», и проверка так и не будет отправлена; задержка позволяет Return попасть в более позднее чтение, чтобы он отправился. Значение по умолчанию соответствует окну стабилизации вставки Claude Code в 500 мс. Установите 0, чтобы отправлять его немедленно.
zh_hans: 提交自动发送的代码评审的 Return 键的延迟时间（以秒为单位）。 当代码评审工作区工具栏自动将评审结果发送到主会话时，它会粘贴结果然后发送 Return 键以提交它们。在粘贴结果完成之后，直到发送该 Return 键所经历的等待时间即为延迟时间。像 Claude Code 这样的粘贴缓冲 TUI 会将一起到来的粘贴和 Return 键视为一个批次，因此 Return 键会被忽略，代码评审也不会被提交；此延迟使 Return 键在稍后的读取中提交。默认设置与 Claude Code 的 500 毫秒粘贴等待窗口一致。设置为 0 可立即提交。

# AdvancedSetting.wrapFocus
source: Should split pane navigation by direction wrap around?
de: Soll die Navigation zwischen geteilten Bereichen nach Richtung umlaufen?
ja: 方向によるスプリットペインのナビゲーションを循環させますか？
pt_br: A navegação de painéis divididos por direção deve dar a volta?
ru: Должна ли навигация по разделённым панелям в заданном направлении зацикливаться?
zh_hans: 分屏窗格导航是否应支持方向环绕？

# AdvancedSetting.xtermVersion
source: xterm version for secondary device attributes (SDA). Increasing this number enables more features in apps but may break things. Use 95 to recover pre-3.4.10 behavior.
de: xterm-Version für Secondary Device Attributes (SDA). Eine Erhöhung dieser Zahl aktiviert mehr Funktionen in Apps, kann aber Dinge kaputt machen. Verwenden Sie 95, um das Verhalten vor 3.4.10 wiederherzustellen.
ja: セカンダリデバイス属性（SDA）用のxtermバージョン。 この数値を増やすとアプリでより多くの機能が有効になりますが、動作が壊れる可能性があります。3.4.10以前の動作に戻すには95を使用してください。
pt_br: Versão do xterm para atributos secundários de dispositivo (SDA). Aumentar este número ativa mais recursos nos apps, mas pode quebrar coisas. Use 95 para recuperar o comportamento anterior à 3.4.10.
ru: Версия xterm для вторичных атрибутов устройства (SDA). Увеличение этого числа включает больше возможностей в приложениях, но может что-то сломать. Используйте 95, чтобы вернуть поведение, как до версии 3.4.10.
zh_hans: 用于辅助设备属性（SDA）的 xterm 版本。 将此数值增大可启用应用程序中的更多功能，但也可能导致问题。使用 95 可恢复 3.4.10 之前的行为。

# AdvancedSetting.zeroWidthSpaceAdvancesCursor
source: Zero-Width Space (U+200B) advances cursor? While a zero-width space should not advance the cursor per the Unicode spec, both Terminal.app and Konsole do this, and Weechat depends on it. You must restart iTerm2 after changing this setting.
de: Rückt ein Leerzeichen ohne Breite (Zero-Width Space, U+200B) den Cursor vor? Obwohl ein Leerzeichen ohne Breite laut Unicode-Spezifikation den Cursor nicht vorrücken sollte, tun dies sowohl Terminal.app als auch Konsole, und Weechat ist darauf angewiesen. Sie müssen iTerm2 nach Ändern dieser Einstellung neu starten.
ja: ゼロ幅スペース（U+200B）でカーソルを進めますか？ Unicode仕様では、ゼロ幅スペースはカーソルを進めるべきではありませんが、Terminal.appとKonsoleはどちらもこれを行い、Weechatはこれに依存しています。この設定を変更した後はiTerm2を再起動する必要があります。
pt_br: O espaço de largura zero (U+200B) avança o cursor? Embora um espaço de largura zero não deva avançar o cursor conforme a especificação Unicode, tanto o Terminal.app quanto o Konsole fazem isso, e o Weechat depende disso. Você deve reiniciar o iTerm2 após alterar este ajuste.
ru: Продвигать курсор при вводе пробела нулевой ширины (U+200B)? Хотя по спецификации Unicode пробел нулевой ширины не должен продвигать курсор, и Terminal.app, и Konsole делают это, а Weechat на это полагается. После изменения этого параметра перезапустите iTerm2.
zh_hans: 零宽度空格（U+200B）是否推进光标？ 虽然根据 Unicode 标准，零宽度空格不应推进光标，但 Terminal.app 和 Konsole 会这样做，Weechat 也依赖此行为。更改此设置后必须重启 iTerm2。

# AdvancedSetting.zippyTextDrawing
source: Use zippy text drawing algorithm? This draws non-ASCII text more quickly but with lower fidelity. This setting is ignored if ligatures are enabled in Settings > Profiles > Text.
de: Schnellen Textzeichenalgorithmus verwenden? Dies zeichnet Nicht-ASCII-Text schneller, aber mit geringerer Genauigkeit. Diese Einstellung wird ignoriert, wenn in Einstellungen > Profile > Text Ligaturen aktiviert sind.
ja: 高速テキスト描画アルゴリズムを使用しますか？ これにより非ASCIIテキストがより速く描画されますが、精度は下がります。「設定 > プロファイル > テキスト」で合字が有効になっている場合、この設定は無視されます。
pt_br: Usar o algoritmo de desenho de texto rápido? Isso desenha texto não ASCII mais rapidamente, mas com menor fidelidade. Este ajuste é ignorado se as ligaduras estiverem ativadas em Ajustes > Perfis > Texto.
ru: Использовать быстрый (zippy) алгоритм отрисовки текста? Он отрисовывает не-ASCII текст быстрее, но с меньшей точностью. Этот параметр игнорируется, если в разделе Настройки > Профили > Текст включены лигатуры.
zh_hans: 使用 zippy 文本绘制算法？ 此算法可更快速绘制非 ASCII 文本，但保真度较低。若在设置 > 配置文件 > 文本中启用了连字，此设置将被忽略。

# AdvancedSettings.DisplayName
source: Advanced Preferences…
de: Erweiterte Einstellungen …
ja: 詳細設定…
pt_br: Preferências avançadas…
ru: Дополнительные настройки…
zh_hans: 高级偏好设置…

# AdvancedSettings.Unspecified
source: Unspecified
de: Nicht angegeben
ja: 未指定
pt_br: Não especificado
ru: Не указано
zh_hans: 未指定

# AdvancedSettingsCategory.Drawing
source: Drawing
de: Zeichnen
ja: 描画
pt_br: Desenho
ru: Отрисовка
zh_hans: 绘制

# AdvancedSettingsCategory.ExperimentalFeatures
source: Experimental Features
de: Experimentelle Funktionen
ja: 実験的機能
pt_br: Recursos experimentais
ru: Экспериментальные функции
zh_hans: 实验性功能

# AdvancedSettingsCategory.General
source: General
de: Allgemein
ja: 一般
pt_br: Geral
ru: Общие
zh_hans: 通用

# AdvancedSettingsCategory.Mouse
source: Mouse
de: Maus
ja: マウス
ru: Мышь
zh_hans: 鼠标

# AdvancedSettingsCategory.Pasteboard
source: Pasteboard
de: Zwischenablage
ja: ペーストボード
pt_br: Área de transferência
ru: Буфер обмена
zh_hans: 剪贴板

# AdvancedSettingsCategory.Scripting
source: Scripting
de: Skripting
ja: スクリプティング
ru: Скрипты
zh_hans: 脚本

# AdvancedSettingsCategory.Session
source: Session
de: Sitzung
ja: セッション
pt_br: Sessão
ru: Сеанс
zh_hans: 会话

# AdvancedSettingsCategory.TipOfTheDay
source: Tip of the Day
de: Tipp des Tages
ja: 今日のヒント
pt_br: Dica do dia
ru: Совет дня
zh_hans: 每日提示

# AdvancedSettingsCategory.Warnings
source: Warnings
de: Warnungen
ja: 警告
pt_br: Avisos
ru: Предупреждения
zh_hans: 警告信息

# AdvancedSettingsCategory.Windows
source: Windows
de: Fenster
ja: ウィンドウ
pt_br: Janelas
ru: Окна
zh_hans: 窗口

# AIError.RequestTooLarge
source: AI token limit exceeded because the conversation reached its maximum length
de: KI-Token-Limit überschritten, da die Unterhaltung ihre maximale Länge erreicht hat
ja: 会話が最大長に達したため、AIのトークン上限を超えました
pt_br: Limite de tokens de IA excedido porque a conversa atingiu seu tamanho máximo
ru: Превышен лимит токенов ИИ, так как беседа достигла максимальной длины.
zh_hans: 由于对话达到最大长度，AI 令牌限制被超出

# AIKeyHint.Authorizes
source: Authorizes with your %@ API key.
de: Authentifiziert sich mit Ihrem %@-API-Schlüssel.
ja: %@のAPIキーで認証します。
pt_br: Autoriza com sua chave de API %@.
ru: Авторизация выполняется с помощью вашего ключа API %@.
zh_hans: 使用您的 %@ API 密钥授权。

# AIKeyHint.NoKeyUsed
source: No API key is used.
de: Es wird kein API-Schlüssel verwendet.
ja: APIキーは使用されません。
pt_br: Nenhuma chave de API é usada.
ru: Ключ API не используется.
zh_hans: 未使用 API 密钥。

# AIManualModels.CopySuffix
source: %@ copy
de: %@-Kopie
ja: %@のコピー
pt_br: %@ cópia
ru: Копия %@
zh_hans: %@ 副本

# AIManualModels.Duplicate
source: Duplicate
de: Duplizieren
ja: 複製
pt_br: Duplicar
ru: Дублировать
zh_hans: 复制

# AIManualModels.EconomyModelAccessibility
source: Economy model
de: Sparmodell
ja: エコノミーモデル
pt_br: Modelo econômico
ru: Экономичная модель
zh_hans: 经济模型

# AIManualModels.EndpointColumn
source: Endpoint
de: Endpunkt
ja: エンドポイント
ru: Конечная точка
zh_hans: 端点

# AIManualModels.ManualModelDefault
source: Manual model
de: Manuelles Modell
ja: 手動モデル
pt_br: Modelo manual
ru: Ручная модель
zh_hans: 手动模型

# AIManualModels.ModelColumn
source: Model
de: Modell
ja: モデル
pt_br: Modelo
ru: Модель
zh_hans: 模型

# AIManualModels.ToggleDefault
source: Toggle Default
de: Standard umschalten
ja: デフォルトを切り替え
pt_br: Alternar padrão
ru: Переключить статус «по умолчанию»
zh_hans: 切换默认值

# AIManualModels.ToggleEconomyModel
source: Toggle Economy Model. A cheaper model used for frequent background jobs like command-safety checks and screen-idle detection.
de: Sparmodell umschalten. Ein günstigeres Modell, das für häufige Hintergrundaufgaben wie Sicherheitsprüfungen von Befehlen und die Erkennung von Bildschirm-Leerlauf verwendet wird.
ja: エコノミーモデルを切り替えます。コマンドの安全性チェックや画面のアイドル検出など、頻繁に実行されるバックグラウンド処理に使用される、より安価なモデルです。
pt_br: Alternar modelo econômico. Um modelo mais barato usado em tarefas frequentes em segundo plano, como verificações de segurança de comandos e detecção de tela ociosa.
ru: Переключить статус «экономичная модель». Более дешёвая модель, используемая для частых фоновых задач, таких как проверка безопасности команд и определение простоя экрана.
zh_hans: 切换经济模型。一种更便宜的模型，用于频繁的后台任务，例如命令安全检查与屏幕空闲检测。

# AIManualModels.UntitledModel
source: Untitled model
de: Unbenanntes Modell
ja: 無題のモデル
pt_br: Modelo sem título
ru: Модель без названия
zh_hans: 未命名模型

# AIManualModels.WindowTitle
source: Manual AI Models
de: Manuelle KI-Modelle
ja: 手動AIモデル
pt_br: Modelos de IA manuais
ru: Ручные модели ИИ
zh_hans: 手动 AI 模型

# AIModelCatalogUpdater.Allow
source: Allow
de: Erlauben
ja: 許可
pt_br: Permitir
ru: Разрешить
zh_hans: 允许

# AIModelCatalogUpdater.ConsentBody
source: iTerm2 can keep its built-in list of AI models current by periodically downloading a cryptographically signed list from iterm2.com. No terminal content or personal data is sent. Allow this?
de: iTerm2 kann seine integrierte Liste der KI-Modelle aktuell halten, indem es regelmäßig eine kryptografisch signierte Liste von iterm2.com herunterlädt. Dabei werden keine Terminal-Inhalte oder persönlichen Daten gesendet. Möchten Sie dies erlauben?
ja: iTerm2は、iterm2.comから暗号署名付きのリストを定期的にダウンロードすることで、組み込みのAIモデル一覧を最新の状態に保つことができます。ターミナルの内容や個人データは送信されません。これを許可しますか？
pt_br: O iTerm2 pode manter sua lista integrada de modelos de IA atualizada baixando periodicamente uma lista assinada criptograficamente de iterm2.com. Nenhum conteúdo do terminal ou dado pessoal é enviado. Permitir isso?
ru: iTerm2 может обновлять встроенный список моделей ИИ, периодически загружая криптографически подписанный список с iterm2.com. Содержимое терминала и личные данные при этом не передаются. Разрешить это?
zh_hans: iTerm2 可以定期从 iterm2.com 下载经过加密签名的列表，以保持内置 AI 模型列表的最新状态。不会发送任何终端内容或个人数据。允许吗？

# AIModelCatalogUpdater.ConsentHeading
source: Check for AI Model Updates?
de: Nach KI-Modell-Updates suchen?
ja: AIモデルの更新を確認しますか？
pt_br: Verificar atualizações dos modelos de IA?
ru: Проверять обновления списка моделей ИИ?
zh_hans: 检查 AI 模型更新？

# AIModelCatalogUpdater.DontAllow
source: Don’t Allow
de: Nicht erlauben
ja: 許可しない
pt_br: Não permitir
ru: Не разрешать
zh_hans: 不允许

# AIModelEditor.AddTitle
source: Add Manual AI Model
de: Manuelles KI-Modell hinzufügen
ja: 手動AIモデルを追加
pt_br: Adicionar modelo de IA manual
ru: Добавить ручную модель ИИ
zh_hans: 添加手动 AI 模型

# AIModelEditor.ConfigurableThinking
source: Configurable thinking
de: Konfigurierbares Denken
ja: 設定可能な思考
pt_br: Pensamento configurável
ru: Настраиваемый режим размышлений
zh_hans: 可配置思维

# AIModelEditor.ConfigurableThinkingTooltip
source: Enable for reasoning models with a thinking mode, such as GPT-5, o-series, or DeepSeek models, so the chat’s Think toggle appears.
de: Aktivieren für Reasoning-Modelle mit Denkmodus, wie GPT-5, die o-Serie oder DeepSeek-Modelle, damit im Chat der „Denken“-Schalter erscheint.
ja: GPT-5、oシリーズ、DeepSeekモデルなど、思考モードを持つ推論モデルで有効にすると、チャットに「Think」トグルが表示されます。
pt_br: Ative para modelos de raciocínio com um modo de pensamento, como GPT-5, série o ou modelos DeepSeek, para que o botão Pensar do chat apareça.
ru: Включите для моделей с режимом размышления, таких как GPT-5, серия o или модели DeepSeek, чтобы в чате появился переключатель «Думать».
zh_hans: 为具有思考模式的推理模型（如 GPT-5、o 系列或 DeepSeek 模型）启用，以便在聊天中显示“思考”开关。

# AIModelEditor.ConnectionFailed
source: Connection Failed
de: Verbindung fehlgeschlagen
ja: 接続に失敗しました
pt_br: Falha na conexão
ru: Не удалось подключиться
zh_hans: 连接失败

# AIModelEditor.ConnectionSucceeded
source: Connection Succeeded
de: Verbindung erfolgreich
ja: 接続に成功しました
pt_br: Conexão bem-sucedida
ru: Подключение установлено
zh_hans: 连接成功

# AIModelEditor.ContextTokensLabel
source: Context tokens:
de: Kontext-Token:
ja: コンテキストトークン:
pt_br: Tokens de contexto:
ru: Контекстные токены:
zh_hans: 上下文令牌：

# AIModelEditor.ContextTokensPositive
source: Context tokens must be greater than zero.
de: Kontext-Token müssen größer als null sein.
ja: コンテキストトークンは0より大きくする必要があります。
pt_br: O número de tokens de contexto deve ser maior que zero.
ru: Количество контекстных токенов должно быть больше нуля.
zh_hans: 上下文令牌数必须大于 0。
